<?php
	
	echo "<h2>Массив книг:</h2>";
	$books = array(
		"451° по Фаренгейту", 
		"Шантарам", 
		"1984", 
		"Мастер и Маргарита", 
		"Портрет Дориана Грея", 
		"Вино из одуванчиков",
		"Цветы для Элджернона",
		"Над пропастью во ржи",
		"Маленький принц",
		"Анна Каренина",
		"Сто лет одиночества",
		"Тень горы",
		"Атлант расправил плечи"
	);
	//Цикл для обхода массива
	echo "<ol>";
	for ($i = 0; $i < count($books); $i++) { 
		echo "<li> $books[$i] </li>";
	}
	echo "</ol>";

	echo "<h2>Массив фильмов:</h2>";
	$films = array("Пролетая над гнездом кукшки", "Сила воли", "Одаренная", "Помни", "Начало");
	//Цикл для обхода массива
	echo "<ol>";
	for ($i = 0; $i < count($films); $i++) { 
		echo "<li> $films[$i] </li>";
	}
	echo "</ol>";
?>